---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PipingFailures.MaxPipeSizeReached
source: html/92ee1567-2083-9425-ae91-911b56cd1030.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PipingFailures.MaxPipeSizeReached Property

Maximum pipe size diameter reached during sizing

## Syntax (C#)
```csharp
public static FailureDefinitionId MaxPipeSizeReached { get; }
```